let data = {

  'name': ['アイヤー', 'ビィリジャー派統一国', '帝都マグルベルカ', '⚙️式社会主義国', '共和国', 'ナニワ惣', 'アイロン公国', '円島衛星国', '保護国'],
  'color': [0, 1, 2, 3, 4, 5, 6, 7, 8],

  'population': [50, 80, 30, 260, 100, 5],
  'army_population': [0, 0, 0, 0, 0, 0],
  'farm': [5, 5, 3, 30, 25, 10],
  'food': [100, 160, 60, 320, 200, 10],
  'iron_factory': [10, 30, 5, 0, 8, 1],
  'iron': [10, 30, 50, 10, 20, 20],
  'rifle': [1, 30, 10, 6, 1, 10], //ライフル
  'rifle_study': [1, 1, 3, 1, 1], //ライフル研究
  'oil_factory': [0, 15, 30, 5, 20, 0],
  'oil': [3, 30, 60, 100, 20, 6],
  'navy': [50, 50, 50, 100, 50, 50],
  'defense': [5, 5, 5, 20, 5, 20],
  'wars': [10, 10, 10, 10, 10, 10], //0は、どことも戦争していない
  'alliance': [0, 0, 0, 0, 0, 0] //0は、協定不参加
}

let computer = { //army, study, diplomacy, civil, wars
  '1': [1, 0, 1, 1, false], //アイヤー
  '2': [1, 2, 1, 1, false], //ビィリジャー派統一国
  '3': [1, 3, 1, 1, false], //⚙️️式社会主義国
  '4': [1, 2, 1, 1, false], //共和国
  '5': [0, 0, 0, 0, false], //ナニワ惣
  '6': [0, 0, 0, 0, false], //アイロン公国
  '7': [0, 0, 0, 0, false], //円島衛星国
  '8': [0, 0, 0, 0, false], //保護国
  '9': [0, 0, 0, 0, false] //???
}