let data = {
  
  'name':['アイヤー','ビィリジャー派統一国','帝都マグルベルカ','⚙️式社会主義国','共和国','ナニワ惣','アイロン公国','円島衛星国','保護国'],
  'color':[0,1,2,3,4,5,6,7,8],
  
  'population':[50,80,30,160,100,5],
  'army_population':[1,5,3,5,8,10],
  'farm':[5,5,3,30,25,10],
  'food':[100,160,60,320,200,10],
  'iron_factory':[10,30,5,10,8,1],
  'iron':[10,30,50,10,20,20],
  'rifle':[1,60,10,6,1,10],//ライフル
  'rifle_study':[1,1,3,1,1],//ライフル研究
  'oil_factory':[0,15,30,5,20,0],
  'oil':[3,30,60,100,20,6],
  'navy':[50,50,50,50,50,50],
  'defense':[0,5,5,5,5,20],
  'alliance':[0,0,0,0,0,0]//0は、協定不参加
}
